
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	День = "дд";
	Месяц = "ММ";
	Год = "гггг";
	Время = "ЧЧ:мм:сс";
	
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	
	СтрокаМесяца = ?(СтрДлина(Месяц) < 3, "." + Месяц + ".", " " + Месяц + " ");
	СтрокаГода = ?(ПустаяСтрока(СловоГода), "", " ''" + СловоГода + "''");
	СтрокаВремени = ?(ПустаяСтрока(Время), "", " " + Время);
	Результат = "ДФ='" + День + СтрокаМесяца + Год + СтрокаГода + СтрокаВремени + "'";
	Закрыть(Результат);
	
КонецПроцедуры