
Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = Новый Структура;
	
	МассивНазначений = Новый Массив;
	Для каждого МД Из Метаданные.Документы Цикл
		МассивНазначений.Добавить(МД.ПолноеИмя());
	КонецЦикла;
	Для каждого МД Из Метаданные.Справочники Цикл
		МассивНазначений.Добавить(МД.ПолноеИмя());
	КонецЦикла;
	
	ПараметрыРегистрации.Вставить("Вид", "ПечатнаяФорма"); 
	ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
	ПараметрыРегистрации.Вставить("Наименование", "Универсальная печатная форма Office");
	ПараметрыРегистрации.Вставить("Версия", "1.2.0");
	ПараметрыРегистрации.Вставить("БезопасныйРежим", ЛОЖЬ);
	ПараметрыРегистрации.Вставить("Информация", "Универсальная печатная форма MS & Open Office");
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление"); 
	ТаблицаКоманд.Колонки.Добавить("Идентификатор"); 
	ТаблицаКоманд.Колонки.Добавить("Использование");
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение");
	ТаблицаКоманд.Колонки.Добавить("Модификатор");
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = "Универсальная ПФ Office";
	НоваяКоманда.Идентификатор = "УниверсальнаяПечатнаяФормаOffice"; 
	НоваяКоманда.Использование = "ОткрытиеФормы";
	НоваяКоманда.ПоказыватьОповещение = Истина;
	НоваяКоманда.Модификатор = "ПечатьMXL";
	
	ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
	
	Возврат ПараметрыРегистрации;
	
КонецФункции
